# методы обработки строк
# методы не изменяют сам объект а работают с их копией

data = 'Hello World!'
# заменяет все вхождения подстроки old на подстроку new
data1 = data.replace('l', '1')

# заменяет count вхождений подстроки old на подстроку new
data1 = data.replace('l', '1', 2)

# удаляет все пробельные символы в их начале и в конце строки
# пробельные символы - tab, пробел, /n
data1 = data.strip()

# удаляет все указанные символы в их начале и в конце строки
data1 = data.strip("*#")

data1 = data.lstrip()
data1 = data.rstrip()

# разделяет строку на подстроки по пробелу, возвращает список
data1 = data.split()

# разделяет строку на подстроки по заданной подстроке  , возвращает список
data = data.split("ll")

# возвращает количество подстроки в строку
#cnt = data.count()

# Срезы
# стандартная нумерация любой строки - слева направо от 0
# обратная нумерация любой строки - справа налево от -1
data = 'hello world!'
print(data[0:5]) # срез с ноль позиции по 5 невключительно
print(data[:5]) # срез от начала до 5 позиции невкл
print(data[5:]) # срез от 5 позиции до конца строки
print(data[6:-1])
print(data[-6:-1])

print(data[::2]) # срез от начала до конца с шагом
print(data[::-1]) # каждый первый символ с конца строки до начала  
